@echo off
:head
echo +---------------------------------------------------------------+
echo *
echo *
echo *
echo *
echo *
echo "	 =@     =@   @/[[[[  @@      @^      ,@@[[[@@`
echo "	 =@     =@   @^      @@      @^     =@`     ,@^
echo "	 =@@@@@@@@   @@@@@^  @@      @^     @^       @@
echo "	 =@     =@   @^      @@      @^     @@       @/
echo "	 =@     =@   @^      @@      @^     ,@\    ,@@
echo "	 ,[     ,[   [[[[[[  [[[[[[` [[[[[[   ,[@@@[
echo *
echo *
echo *
echo *
echo *
echo *	     			%date%%time%
echo +---------------------------------------------------------------+
echo *
echo *	     查看连接过的WIFI......
echo *
echo +---------------------------------------------------------------+
netsh wlan show profile
echo +---------------------------------------------------------------+
echo *
echo *	     如上是连接过的WIFI，
set /p name=*	     请输入需要查看连接密码的WIFI名称：
echo *
echo +---------------------------------------------------------------+
echo *
echo *	     查询%name%的密码中......
echo *
echo +---------------------------------------------------------------+
netsh wlan show profile name="%name%" key=clear
echo +---------------------------------------------------------------+
echo *
echo *	     程序运行结束......
echo *
echo +---------------------------------------------------------------+
echo *	     按下三次任意按键即可再次查询~
pause>nul
pause>nul
pause>nul
echo *                
echo * *              
echo * * *            
echo * * * *          
echo * * * * *        
echo * * * * * *      
echo * * * * * * *    
echo * * * * * * * *
echo * * * * * * * * *  
echo * * * * * * * * * * 
echo * * * * * * * * * * * 
echo * * * * * * * * * * * * 
echo +---------------------------------------------------------------+
echo *
echo *	     重新开始查询......
echo *
echo +---------------------------------------------------------------+
goto :head
